Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_uart.c
/*@} end of group UART_Private_Functions */

/** @defgroup  UART_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  UART initialization function
 *
 * @param  uartId: UART ID type
 * @param  uartCfg: UART configuration structure pointer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_Init(UART_ID_Type uartId, UART_CFG_Type *uartCfg)
{
    uint32_t tmpValTxCfg = 0;
    uint32_t tmpValRxCfg = 0;
    uint32_t fraction = 0;
    uint32_t baudRateDivisor = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_PARITY_TYPE(uartCfg->parity));
    CHECK_PARAM(IS_UART_DATABITS_TYPE(uartCfg->dataBits));
    CHECK_PARAM(IS_UART_STOPBITS_TYPE(uartCfg->stopBits));
    CHECK_PARAM(IS_UART_BYTEBITINVERSE_TYPE(uartCfg->byteBitInverse));

    /* Cal the baud rate divisor */
    fraction = uartCfg->uartClk * 10 / uartCfg->baudRate % 10;
    baudRateDivisor = uartCfg->uartClk / uartCfg->baudRate;

    if (fraction >= 5) {
        ++baudRateDivisor;
    }

    /* Set the baud rate register value */
    BL_WR_REG(UARTx, UART_BIT_PRD, ((baudRateDivisor - 1) << 0x10) | ((baudRateDivisor - 1) & 0xFFFF));

    /* Configure parity type */
    tmpValTxCfg = BL_RD_REG(UARTx, UART_UTX_CONFIG);
    tmpValRxCfg = BL_RD_REG(UARTx, UART_URX_CONFIG);

    switch (uartCfg->parity) {
        case UART_PARITY_NONE:
            tmpValTxCfg = BL_CLR_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_EN);
            tmpValRxCfg = BL_CLR_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_EN);
            break;

        case UART_PARITY_ODD:
            tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_EN);
            tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_SEL);
            tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_EN);
            tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_SEL);
            break;

        case UART_PARITY_EVEN:
            tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_EN);
            tmpValTxCfg = BL_CLR_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_SEL);
            tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_EN);
            tmpValRxCfg = BL_CLR_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_SEL);
            break;

        default:
            break;
    }

    /* Configure data bits */
    tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_BIT_CNT_D, (uartCfg->dataBits + 4));
    tmpValRxCfg = BL_SET_REG_BITS_VAL(tmpValRxCfg, UART_CR_URX_BIT_CNT_D, (uartCfg->dataBits + 4));

    /* Configure tx stop bits */
    tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_BIT_CNT_P, uartCfg->stopBits);

    /* Configure tx cts flow control function */
    if (ENABLE == uartCfg->ctsFlowControl) {
        tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UTX_CTS_EN);
    } else {
        tmpValTxCfg = BL_CLR_REG_BIT(tmpValTxCfg, UART_CR_UTX_CTS_EN);
    }

    /* Configure rx input de-glitch function */
    if (ENABLE == uartCfg->rxDeglitch) {
        tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_DEG_EN);
    } else {
        tmpValRxCfg = BL_CLR_REG_BIT(tmpValRxCfg, UART_CR_URX_DEG_EN);
    }

    /* Configure rx rts output SW control mode */
    if (ENABLE == uartCfg->rtsSoftwareControl) {
        tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_RTS_SW_MODE);
    } else {
        tmpValRxCfg = BL_CLR_REG_BIT(tmpValRxCfg, UART_CR_URX_RTS_SW_MODE);
    }

    /* Write back */
    BL_WR_REG(UARTx, UART_UTX_CONFIG, tmpValTxCfg);
    BL_WR_REG(UARTx, UART_URX_CONFIG, tmpValRxCfg);

    /* Configure LSB-first or MSB-first */
    tmpValTxCfg = BL_RD_REG(UARTx, UART_DATA_CONFIG);

    if (UART_MSB_FIRST == uartCfg->byteBitInverse) {
        tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UART_BIT_INV);
    } else {
        tmpValTxCfg = BL_CLR_REG_BIT(tmpValTxCfg, UART_CR_UART_BIT_INV);
    }

    BL_WR_REG(UARTx, UART_DATA_CONFIG, tmpValTxCfg);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(UART0_IRQn, UART0_IRQHandler);
    Interrupt_Handler_Register(UART1_IRQn, UART1_IRQHandler);
#endif
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set default value of all registers function
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_DeInit(UART_ID_Type uartId)
{
    if (UART0_ID == uartId) {
        GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_UART0);
    } else if (UART1_ID == uartId) {
        GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_UART1);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure fifo function
 *
 * @param  uartId: UART ID type
 * @param  fifoCfg: FIFO configuration structure pointer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_FifoConfig(UART_ID_Type uartId, UART_FifoCfg_Type *fifoCfg)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Deal with uart fifo configure register */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_1);
    /* Configure dma tx fifo threshold */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_TX_FIFO_TH, fifoCfg->txFifoDmaThreshold);
    /* Configure dma rx fifo threshold */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_RX_FIFO_TH, fifoCfg->rxFifoDmaThreshold);
    /* Write back */
    BL_WR_REG(UARTx, UART_FIFO_CONFIG_1, tmpVal);

    /* Enable or disable uart fifo dma function */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);

    if (ENABLE == fifoCfg->txFifoDmaEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_DMA_TX_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_DMA_TX_EN);
    }

    if (ENABLE == fifoCfg->rxFifoDmaEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_DMA_RX_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_DMA_RX_EN);
    }

    BL_WR_REG(UARTx, UART_FIFO_CONFIG_0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure infra function
 *
 * @param  uartId: UART ID type
 * @param  irCfg: IR configuration structure pointer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_IrConfig(UART_ID_Type uartId, UART_IrCfg_Type *irCfg)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Configure tx ir mode */
    tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);

    if (ENABLE == irCfg->txIrEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_UTX_IR_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_IR_EN);
    }

    if (ENABLE == irCfg->txIrInverse) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_UTX_IR_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_IR_INV);
    }

    BL_WR_REG(UARTx, UART_UTX_CONFIG, tmpVal);

    /* Configure rx ir mode */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);

    if (ENABLE == irCfg->rxIrEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_URX_IR_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_URX_IR_EN);
    }

    if (ENABLE == irCfg->rxIrInverse) {
        tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_URX_IR_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_URX_IR_INV);
    }

    BL_WR_REG(UARTx, UART_URX_CONFIG, tmpVal);

