Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_uart.c
    /* Get detection value */
    tmpVal = UART_GetAutoBaudCount(uartId, autoBaudDet);

    /* Set tx baudrate */
    BL_WR_REG(UARTx, UART_BIT_PRD, tmpVal << 0x10 | tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART set rx rts output software control value
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SetRtsValue(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Rts set 1*/
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
    BL_WR_REG(UARTx, UART_URX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_URX_RTS_SW_VAL));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART clear rx rts output software control value
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_ClrRtsValue(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Rts clear 0 */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
    BL_WR_REG(UARTx, UART_URX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_URX_RTS_SW_VAL));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure tx free run mode function
 *
 * @param  uartId: UART ID type
 * @param  txFreeRun: Enable or disable tx free run mode
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_TxFreeRun(UART_ID_Type uartId, BL_Fun_Type txFreeRun)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Enable or disable tx free run mode */
    tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);

    if (ENABLE == txFreeRun) {
        BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_UTX_FRM_EN));
    } else {
        BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_FRM_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART configure auto baud rate detection function
 *
 * @param  uartId: UART ID type
 * @param  autoBaud: Enable or disable auto function
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_AutoBaudDetection(UART_ID_Type uartId, BL_Fun_Type autoBaud)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Enable or disable auto baud rate detection function */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);

    if (ENABLE == autoBaud) {
        BL_WR_REG(UARTx, UART_URX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_URX_ABR_EN));
    } else {
        BL_WR_REG(UARTx, UART_URX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_URX_ABR_EN));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART tx fifo clear
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_TxFifoClear(UART_ID_Type uartId)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Clear tx fifo */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);
    BL_WR_REG(UARTx, UART_FIFO_CONFIG_0, BL_SET_REG_BIT(tmpVal, UART_TX_FIFO_CLR));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART rx fifo clear
 *
 * @param  uartId: UART ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_RxFifoClear(UART_ID_Type uartId)
{
    uint32_t tmpVal = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Clear rx fifo */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);
    BL_WR_REG(UARTx, UART_FIFO_CONFIG_0, BL_SET_REG_BIT(tmpVal, UART_RX_FIFO_CLR));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART mask or unmask certain or all interrupt
 *
 * @param  uartId: UART ID type
 * @param  intType: UART interrupt type
 * @param  intMask: UART interrupt mask value( MASK:disbale interrupt,UNMASK:enable interrupt )
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_IntMask(UART_ID_Type uartId, UART_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    tmpVal = BL_RD_REG(UARTx, UART_INT_MASK);

    /* Mask or unmask certain or all interrupt */
    if (UART_INT_ALL == intType) {
        if (MASK == intMask) {
            tmpVal |= 0xff;
        } else {
            tmpVal &= 0;
        }
    } else {
        if (MASK == intMask) {
            tmpVal |= 1 << intType;
        } else {
            tmpVal &= ~(1 << intType);
        }
    }

    /* Write back */
    BL_WR_REG(UARTx, UART_INT_MASK, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART clear certain or all interrupt
 *
 * @param  uartId: UART ID type
 * @param  intType: UART interrupt type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_IntClear(UART_ID_Type uartId, UART_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_INT_TYPE(intType));

    tmpVal = BL_RD_REG(UARTx, UART_INT_CLEAR);

    /* Clear certain or all interrupt */
    if (UART_INT_ALL == intType) {
        tmpVal |= 0xff;
    } else {
        tmpVal |= 1 << intType;
    }

    /* Write back */
    BL_WR_REG(UARTx, UART_INT_CLEAR, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Install uart interrupt callback function
 *
 * @param  uartId: UART ID type
 * @param  intType: UART interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_Int_Callback_Install(UART_ID_Type uartId, UART_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_INT_TYPE(intType));

    uartIntCbfArra[uartId][intType] = cbFun;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART send data to tx fifo
 *
 * @param  uartId: UART ID type
 * @param  data: The data to be send
 * @param  len: The length of the send buffer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SendData(UART_ID_Type uartId, uint8_t *data, uint32_t len)
{
    uint32_t txLen = 0;
    uint32_t UARTx = uartAddr[uartId];
    uint32_t timeoutCnt = UART_TX_TIMEOUT_COUNT;

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

