Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_uart.c
    /* Send data */
    while (txLen < len) {
        if (UART_GetTxFifoCount(uartId) > 0) {
            BL_WR_BYTE(UARTx + UART_FIFO_WDATA_OFFSET, data[txLen++]);
            timeoutCnt = UART_TX_TIMEOUT_COUNT;
        } else {
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART send data to tx fifo in block mode
 *
 * @param  uartId: UART ID type
 * @param  data: The data to be send
 * @param  len: The length of the send buffer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type UART_SendDataBlock(UART_ID_Type uartId, uint8_t *data, uint32_t len)
{
    uint32_t txLen = 0;
    uint32_t UARTx = uartAddr[uartId];
    uint32_t timeoutCnt = UART_TX_TIMEOUT_COUNT;

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Send data */
    while (txLen < len) {
        if (UART_GetTxFifoCount(uartId) > 0) {
            BL_WR_BYTE(UARTx + UART_FIFO_WDATA_OFFSET, data[txLen++]);
            timeoutCnt = UART_TX_TIMEOUT_COUNT;
        } else {
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        }
    }

    while (UART_GetTxBusBusyStatus(uartId) == SET) {
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  UART receive data from rx fifo
 *
 * @param  uartId: UART ID type
 * @param  data: The receive data buffer
 * @param  maxLen: The max length of the buffer
 *
 * @return The length of the received buffer
 *
*******************************************************************************/
uint32_t UART_ReceiveData(UART_ID_Type uartId, uint8_t *data, uint32_t maxLen)
{
    uint32_t rxLen = 0;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Receive data */
    while (rxLen < maxLen && UART_GetRxFifoCount(uartId) > 0) {
        data[rxLen++] = BL_RD_BYTE(UARTx + UART_FIFO_RDATA_OFFSET);
    }

    return rxLen;
}

/****************************************************************************/ /**
 * @brief  UART get auto baud count value
 *
 * @param  uartId: UART ID type
 * @param  autoBaudDet: Detection using codeword 0x55 or start bit
 *
 * @return Bit period of auto baudrate detection
 *
*******************************************************************************/
uint16_t UART_GetAutoBaudCount(UART_ID_Type uartId, UART_AutoBaudDetection_Type autoBaudDet)
{
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_AUTOBAUDDETECTION_TYPE(autoBaudDet));

    /* Select 0x55 or start bit detection value */
    if (UART_AUTOBAUD_0X55 == autoBaudDet) {
        return BL_RD_REG(UARTx, UART_STS_URX_ABR_PRD) >> 0x10 & 0xffff;
    } else {
        return BL_RD_REG(UARTx, UART_STS_URX_ABR_PRD) & 0xffff;
    }
}

/****************************************************************************/ /**
 * @brief  UART get tx fifo unoccupied count value
 *
 * @param  uartId: UART ID type
 *
 * @return Tx fifo unoccupied count value
 *
*******************************************************************************/
uint8_t UART_GetTxFifoCount(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(UARTx, UART_FIFO_CONFIG_1), UART_TX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  UART get rx fifo occupied count value
 *
 * @param  uartId: UART ID type
 *
 * @return Rx fifo occupied count value
 *
*******************************************************************************/
uint8_t UART_GetRxFifoCount(UART_ID_Type uartId)
{
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameter */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(UARTx, UART_FIFO_CONFIG_1), UART_RX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  Get uart interrupt status
 *
 * @param  uartId: UART ID type
 * @param  intType: UART interrupt type
 *
 * @return Status of interrupt
 *
*******************************************************************************/
BL_Sts_Type UART_GetIntStatus(UART_ID_Type uartId, UART_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_INT_TYPE(intType));

    /* Get certain or all interrupt status */
    tmpVal = BL_RD_REG(UARTx, UART_INT_STS);

    if (UART_INT_ALL == intType) {
        if ((tmpVal & 0xff) != 0) {
            return SET;
        } else {
            return RESET;
        }
    } else {
        if ((tmpVal & (1U << intType)) != 0) {
            return SET;
        } else {
            return RESET;
        }
    }
}

/****************************************************************************/ /**
 * @brief  Get indicator of uart tx bus busy
 *
 * @param  uartId: UART ID type
 *
 * @return Status of tx bus
 *
*******************************************************************************/
BL_Sts_Type UART_GetTxBusBusyStatus(UART_ID_Type uartId)
{
    uint32_t tmpVal;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Get tx bus busy status */
    tmpVal = BL_RD_REG(UARTx, UART_STATUS);

    if (BL_IS_REG_BIT_SET(tmpVal, UART_STS_UTX_BUS_BUSY)) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  Get indicator of uart rx bus busy
 *
 * @param  uartId: UART ID type
 *
 * @return Status of rx bus
 *
*******************************************************************************/
BL_Sts_Type UART_GetRxBusBusyStatus(UART_ID_Type uartId)
{
    uint32_t tmpVal;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));

    /* Get rx bus busy status */
    tmpVal = BL_RD_REG(UARTx, UART_STATUS);

