Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_uart.c
    if (BL_IS_REG_BIT_SET(tmpVal, UART_STS_URX_BUS_BUSY)) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  Get tx/rx fifo overflow or underflow status
 *
 * @param  uartId: UART ID type
 * @param  overflow: Select tx/rx overflow or underflow
 *
 * @return Status of tx/rx fifo
 *
*******************************************************************************/
BL_Sts_Type UART_GetOverflowStatus(UART_ID_Type uartId, UART_Overflow_Type overflow)
{
    uint32_t tmpVal;
    uint32_t UARTx = uartAddr[uartId];

    /* Check the parameters */
    CHECK_PARAM(IS_UART_ID_TYPE(uartId));
    CHECK_PARAM(IS_UART_OVERFLOW_TYPE(overflow));

    /* Get tx/rx fifo overflow or underflow status */
    tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);

    if ((tmpVal & (1U << (overflow + 4))) != 0) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  Get current baudrate function
 *
 * @param  uartId: UART ID type
 *
 * @return Baudrate
 *
*******************************************************************************/
uint32_t UART_GetBaudrate(UART_ID_Type uartId)
{
    uint32_t clock = 0;
    uint32_t tmpVal = 0;
    uint32_t div1 = 1;
    uint32_t div2 = 1;
    uint32_t UARTx = uartAddr[uartId];

    /* Get uart clock */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG2);
    div2 = BL_GET_REG_BITS_VAL(tmpVal, GLB_UART_CLK_DIV) + 1;

    if (BL_IS_REG_BIT_SET(tmpVal, GLB_HBN_UART_CLK_SEL)) {
        clock = 160000000;
    } else {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG0);
        div1 = BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_HCLK_DIV);
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, GLB_HBN_ROOT_CLK_SEL);

        if (tmpVal == 0) {
            clock = 32000000;
        } else if (tmpVal == 1) {
            clock = 40000000;
        } else {
            tmpVal = BL_RD_REG(GLB_BASE, GLB_CLK_CFG0);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, GLB_REG_PLL_SEL);

            switch (tmpVal) {
                case 0:
                    clock = 48000000;
                    break;

                case 1:
                    clock = 120000000;
                    break;

                case 2:
                    clock = 160000000;
                    break;

                case 3:
                    clock = 192000000;
                    break;

                default:
                    clock = 160000000;
                    break;
            }
        }

        clock /= div1;
    }

    clock /= div2;

    /* Get uart bit period */
    tmpVal = BL_RD_REG(UARTx, UART_BIT_PRD);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, UART_CR_UTX_BIT_PRD) + 1;

    return (clock / tmpVal);
}

/****************************************************************************/ /**
 * @brief  UART0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#if 1                                                                          //#ifndef BFLB_USE_HAL_DRIVER
void UART0_IRQHandler(void)
{
    UART_IntHandler(UART0_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  UART1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#if 1                                                                          //#ifndef BFLB_USE_HAL_DRIVER
void UART1_IRQHandler(void)
{
    UART_IntHandler(UART1_ID);
}
#endif

/*@} end of group UART_Public_Functions */

/*@} end of group UART */

/*@} end of group BL602_Peripheral_Driver */
